## Extract, transform, load (ETL)

In [11]:
import pandas as pd
from sqlalchemy import create_engine

In [ ]:

# Define PostgreSQL connection
POSTGRES_CONNECTION = create_engine('postgresql://user:password@localhost:5432/dbname')

In [12]:
data_frame = pd.read_csv("data/raw_data.csv")
data_frame.head()

,name,number_of_firms,total_taxable_income,total_taxes_paid,total_cash_taxes_paid
0,Advertising,58,3891.0,961.680,940.393
1,Aerospace/Defense,77,30920.0,5106.380,7441.780
2,Air Transport,21,1820.0,655.214,240.024
3,Apparel,39,5423.0,1112.110,1479.290
4,Auto & Truck,31,33360.0,3529.000,2446.900

In [13]:
data_frame.loc[data_frame["name"] == "Apparel", :]

,name,number_of_firms,total_taxable_income,total_taxes_paid,total_cash_taxes_paid
3,Apparel,39,5423.0,1112.11,1479.29

In [15]:
data_frame.loc[:, ["name", "number_of_firms"]]

                                 name  number_of_firms
0                         Advertising               58
1                   Aerospace/Defense               77
2                       Air Transport               21
3                             Apparel               39
4                        Auto & Truck               31
..                                ...              ...
91                           Trucking               35
92                  Utility (General)               15
93                    Utility (Water)               16
94                       Total Market             7165
95  Total Market (without financials)             5649

[96 rows x 2 columns]

In [17]:
data_frame.to_csv("data/clean_data.csv")

In [21]:
def extract(file_name):
  return pd.read_csv(file_name)

def transform(data_frame):
  # Filter the data_frame to only incude a subset of columns
  return data_frame.loc[:, ["industry_name", "number_of_firms"]]


def load(data_frame, file_name):
  # Write cleaned_data to a CSV using file_name
  data_frame.to_csv(file_name, index=False)
  print(f"Successfully loaded data to {file_name}")

extracted_data = extract(file_name="data/raw_data.csv")

# Transform extracted_data using transform() function
transformed_data = transform(data_frame=extracted_data)

# Load transformed_data to the file transformed_data.csv
load(data_frame=transformed_data, file_name="data/transformed_data.csv")

Successfully loaded data to transformed_data.csv

In [ ]:
# Complete building the transform() function
data_warehouse = POSTGRES_CONNECTION
def transform(source_table, target_table):
  data_warehouse.execute(f"""
  CREATE TABLE {target_table} AS
      SELECT
          CONCAT("Product ID: ", product_id),
          quantity * price
      FROM {source_table};
  """)

extracted_data = extract(file_name="raw_sales_data.csv")
load(data_frame=extracted_data, table_name="raw_sales_data")

# Populate total_sales by transforming raw_sales_data
transform(source_table="raw_sales_data", target_table="total_sales")

In [ ]:
def extract(file_name):
    """Extract data from CSV file"""
    data = pd.read_csv(file_name)
    print(f"Extracted {len(data)} rows from {file_name}")
    return data

def transform(data_frames):
    transformed = data_frames.copy()
    print(f"Transformed {len(transformed)} rows")
    return transformed
def load(data_frames, target_table):
    data_frames.to_sql(name=target_table, con=POSTGRES_CONNECTION)
    print(f"Loading data into {target_table} completed.")
extracted_data = extract(file_name="data/raw_data.csv")
transformed_data = transform(extracted_data)
load(data_frames=transformed_data, target_table="final_table")